import React, { Component } from 'react'
import {Accordion, Panel} from 'react-bootstrap'
import { Link } from 'react-router'

import './styles.less'

import img1 from "./img/img1.jpg";
import img2 from "./img/img2.jpg";
import img3 from "./img/img3.jpg";
import img4 from "./img/img4.jpg";
import img5 from "./img/img5.jpg";
import img6 from "./img/img6.jpg";
import img7 from "./img/img7.jpg";
import img8 from "./img/img8.jpg";
import img9 from "./img/img9.jpg";
import img10 from "./img/img10.jpg";
import img11 from "./img/img11.jpg";
import img12 from "./img/img12.jpg";

export default function HelpBox() {
    return (
        <div className="container">
            <div className="box box-default">
                <div className="box-header with-border text-center">
                    <h3 className="box-title"> Керівництво користувачу </h3>
                </div>
                <div className="box-body">
                    <Accordion className="accordion accordion--help">
                        <Panel header="1. Загальні відомості" eventKey="1">
                            <p>
                                АІС "КП" надає простий та зручний графічний інтерфейс користувачам
                                для управління базами даних посад в університеті та державі.
                            </p>
                        </Panel>
                        <Panel header='2. Можливості "АІС КП"' eventKey="2">
                            <p>
                                Система володіє наступними функціональними характеристиками:
                            </p>
                            <ul>
                                <li>
                                    Проведення аутентифікації та авторизації користувачів по їх логіну та паролю чи токену авторизації.
                                </li>
                                <li>
                                    Завантаження інформації про користувача, а саме імені, прізвища та фотографії(за умови наявності її у відповідній базі даних користувачів) та відображення цієї інформації на графічному інтерфейсі користувача системи щоб було видно хто зараз авторизований.
                                </li>
                                <li>
                                    Контроль доступу до системи в цілому та до кожної із основних операцій, а саме: <br/>
                                    -	контроль можливості додавання посад; <br/>
                                    -	контроль можливості редагування посад; <br/>
                                    -	контроль можливості видалення посад; <br/>
                                    -	контроль можливості пошуку посад; <br/>
                                    -	контроль можливості завантаження результатів пошуку у файл таблиці Excel; <br/>
                                    -	контроль можливості додавання нових значень до списків з даними які формують інформацію про посади; <br/>
                                    -	можливості видалення значень зі списків з даними які формують інформацію про посади; <br/>
                                    -	можливості редагування значень списків з даними які формують інформацію про посади.
                                </li>
                                <li>
                                    Можливість додавання нових посад із супутньою інформацією через графічний інтерфейс користувача.
                                </li>
                                <li>
                                    Можливість автоматизованого заповнення(через діалог з користувачем) полів із текстами («Завдання, обов'язки та повноваження», «Повинен знати», «Кваліфікаційні вимоги») та наборів кодів про нову посаду даними з інших посад.
                                </li>
                                <li>
                                    Перевірка на коректність введених даних, виведення повідомлень користувачу у випадках виникнення помилок.
                                </li>
                                <li>
                                    Можливість гнучкого пошуку посад(з накладанням фільтрів): назва посади, приналежність до посадового складу, наявність відповідної посади в КПІ/державі, діапазони дат створення та відміни посади.
                                </li>
                                <li>
                                    Можливість сортування результатів пошуку(за зростанням/спаданням значень полів посади), пагінація(відображення результатів пошуку порціями), вибір розміру відображуваної порції списку з результатами пошуку.
                                </li>
                                <li>
                                    Вивантаження результатів пошуку в Excel файл з можливістю вибору полів, які включаються в звіт та зміна їх порядку.
                                </li>
                                <li>
                                    Можливість редагування посади та інформації пов’язаної з нею через графічний інтерфейс користувача.
                                </li>
                                <li>
                                    Можливість видалення посад або пов’язаної з ними інформації через графічний інтерфейс користувача.
                                </li>
                                <li>
                                    Можливість перегляду, додавання нових значення, видалення, редагування списків з даними які формують інформацію про посади, а саме: посадового складу, кодів посад(КП, ЄТКД, ЗКППТР, ДКХП), текстів кваліфікаційних вимог, завдань обов’язків та повноважень посади через графічний інтерфейс користувача.
                                </li>
                            </ul>
                        </Panel>
                        <Panel header='3. Мета запровадження "АІС КП"' eventKey="3">
                            <p>
                                Ціллю створення даної АІС є надання простого та зручного
                                графічного інтерфейсу користувачам для роботи з
                                базами даних посад із можливістю гнучкого пошуку посад,
                                додавання нових значень, редагування, видалення посад,
                                при цьому необхідно контролювати доступ користувачів до системи
                                в залежності від повноважень авторизованих користувачів.
                            </p>
                        </Panel>
                        <Panel header="4. Системні вимоги" eventKey="4">
                            <p>
                                Для роботи додатку необхідне мережеве з’єднання комп’ютера із
                                сервером та веб-браузер Opera, Mozilla Firefox, чи Google Chrome останньої версії.
                                <br/>
                                Коректність роботи гарантується у браузері Google Chrome версій 45-58.
                            </p>
                        </Panel>
                        <Panel header='5. Що ви повинні знати' eventKey="5">
                            <p>
                                Характер викладу даного Посібника припускає,
                                що ви маєте базові навички роботи з комп'ютером,
                                операційною системою та WEB-браузером,
                                а також знаєте предметну область
                                (особливості посад в НТУУ "КПІ ім. Ігоря Сікорського" та Україні загалом)
                            </p>
                            <p>
                                Якщо ви недостатньо добре володієте перерахованими вище поняттями і навичками,
                                рекомендуємо звернутися до документації чи спеціалістів по цим темам.
                            </p>
                            <p>
                                <br/>
                                <b> Увага! Інформація про посади у цій системі має такі особливості: </b> <br/>
                                <ol>
                                    <li>
                                        Назви посад у системі формуються ієрархічно,
                                        як <u> уточнювана посада </u> та <u>уточнюючтй вираз(уточнення)</u>. <br/>
                                        Наприклад, посада "Головний страховий експерт з охорони праці"
                                        має таку структуру: <br/>
                                        головний -> експерт -> страховий -> з охорони праці <br/>
                                        Якщо це нова посада(вона не уточнює жодну із інших посад),
                                        то її назва складається із самого лиш <u>уточнення</u>,
                                        а <u>"уточнювана посада"</u> відсутня. <br/>
                                    </li>
                                    <li>
                                        Інформація про усі основні поля посади(а, саме
                                        Посадовий склад,
                                        Уточнення,
                                        Код КП,
                                        Код ЄТДК,
                                        Код ЗКППТР,
                                        Код ДКХП,
                                        Завдання, обов'язки та повноваження,
                                        Повинен знати,
                                        Кваліфікаційні вимоги)
                                        береться із відповідних списків.
                                        Елементи цих списків можна контролювати на спеціальній сторінці
                                        <Link to="/ctrldict"> "Контроль списків" </Link>.
                                    </li>
                                </ol>
                            </p>
                        </Panel>
                        <Panel header="6. Інтерфейс програми" eventKey="6">
                            <p>
                                WEB=додаток має 4 основних сторінки із можливістю навігації між ними:
                            </p>
                            <ul>
                                <li>
                                    сторінка авторизації, де неавторизованим користувачам показується форма авторизації, а авторизованим – меню для навігації між сторінками.
                                </li>
                                <li>
                                    сторінка додавання посад
                                </li>
                                <li>
                                    сторінка контролю списків
                                </li>
                                <li>
                                    сторінка пошуку посад
                                </li>
                            </ul>
                            <p>
                                В залежності від прав доступу користувача, деякі з цих сторінок будуть йому недоступними, а при спробі відкрити сторінку доступ до якої користувачу заборонено, його буде перенаправлено на сторінку авторизації і виведено відповідне повідомлення.
                            </p>
                            <p>
                                У всіх станах (крім процесу авторизації користувача із відображуваною на екрані лише формою для авторизації) на екрані є компоненти із
                            </p>
                            <ul>
                                <li>
                                    «Шапкою» (Header), де розміщується логотип додатку, навігаційне меню та піктограма авторизованого користувача з випадаючою кнопкою для виходу із системи.
                                </li>
                                <li>
                                    Блок із основною активною формою (для додавання посад, пошуку, тощо)
                                </li>
                                <li>
                                    «Нижнім колонтитулом»(Footer) у якому розміщено інформацію про розробників програмного продукту
                                </li>
                            </ul>
                        </Panel>
                        <Panel header="7. Реєстрація нових користувачів" eventKey="7">
                            <p>
                                Реєстрацією нових користувачів уповноважений займатися тільки системний адміністратор або адміністратор бази даних. При цьому якщо ви бажаєте встановити/змінити ваш персональний логін – для цього теж необхідно звернутися до системного адміністратора або адміністратора БД, який додасть/змінить ваші персональні дані в БД та назначить вам небхідні права доступу.
                            </p>
                            <p>
                                Після отримання комбінації логін/пароль від адміністраторів особисто або в електронному листі ви маєте доступ до додатку.
                            </p>
                        </Panel>
                        <Panel header="8. Вхід у систему" eventKey="8">
                            <p>
                                <b>
                                    Без реалізації попереднього пункту(отримання вашого логіна та пароля від уповноваженої особи) вхід у програму не є можливим.
                                </b>
                            </p>
                            <p>
                                Для роботи із додатком необхідно авторизуватися. Доступ неавторизованим користувачам заборонено.
                            </p>
                            <p>
                                У разі, якщо ви правильно ввели дані (логін та пароль), завантажаться дані про вас і замість форми авторизації з’явиться меню навігації для переходу до форм додавання, пошуку посад, контролю списків даних які використовуютьс посадами та виходу із системи.
                            </p>
                            <p>
                                Якщо у полях для авторизації було допущено помилку, логін/пароль не вірні, нема мережевого з’єднання, чи сталася помилка на сервері система виведе відповідне повідомлення.
                            </p>
                        </Panel>
                        <Panel header="9. Вихід із аккаунта" eventKey="9">
                            <p>
                                Для виходу із аккаунта потрібно натиснути на кнопку з текстом "Вихід з аккаунта":
                            </p>
                            <p> a) В меню домашньої сторінки </p>
                            <p className="text-center">
                                <img src={img1} className="img-responsive img-thumbnail" alt="Рисунок 5а" />
                            </p>
                            <br/>
                            <p>
                                б) У випадаючому меню(щоб воно з'явилось потрібно натиснути на ім'я користувача) під іменем користувача у "Шапці" (верхній панелі) додатку
                            </p>
                            <p className="text-center">
                                <img src={img2} className="img-responsive img-thumbnail" alt="Рисунок 5б" />
                            </p>
                        </Panel>
                        <Panel header="10. Додавання посад" eventKey="10">
                            <p>
                                Додавання посад відбувається на відповідній формі, перейти до якої можна за допомогою навігаційного меню, або за адресою <Link to="/add"> ==Посилання на сторінку додавання посад== </Link>.
                            </p>
                            <p>
                                Ця форма має текстові поля для введення усіх даних про посаду. Тут частину даних можна ввести як вручну, так і взяти значення із списків-словників, які підвантажуються із сервера.
                            </p>
                            <p>
                                Тексти з описом посади(завдання, обов'язки та повноваження, повинен знати, кваліфікаційні вимоги), та коди можна додати із інших посад у відповідному модальному вікні для цього треба натиснути на кнопку з піктограмою<i className="fa fa-link" />.
                            </p>
                            <p className="text-center">
                                <img src={img3} className="img-responsive img-thumbnail" alt="Рисунок 6.1" />
                            </p>
                            <p>
                                Відкриється модальне вікно з пошуковою формою. Користувач може знайти там інші посади та обрати необхідне значення, після чого це значення підставиться у відповідне поле на формі додавання.
                            </p>
                            <p>
                                Так як кожна посада могла у різні терміни своєї дії мати різні набори кодів та текстів з описами, на формі можна додавати чи видаляти декілька наборів з відповідними полями. Для додавання ще 1 набору кодів, чи тексту потрібно натиснути на кнопку з піктограмою «+» під іншими полями цієї секії, а для видалення 1 із порцій, треба натиснути на кнопку з піктограмою «х» у правому верхньому кутку відповідної порції полів.
                            </p>
                            <p className="text-center">
                                <img src={img4} className="img-responsive img-thumbnail" alt="Рисунок 6.2" />
                            </p>
                            <br/>
                            <p>
                                У полях для дат їх можна ввести як вручну, так і додати зі зручного віджета-календаря.
                            </p>
                            <p className="text-center">
                                <img src={img5} className="img-responsive img-thumbnail" alt="Рисунок 6.3" />
                            </p>
                            <br/>
                            <p>
                                Перед відправкою даних на сервер проводиться валідація введених даних та виведення підказок користувачеві про наявні помилки.
                            </p>
                        </Panel>
                        <Panel header="11. Пошук, перегляд посад" eventKey="11">
                            <p>
                                Для пошуку та перегляду посад треба перейти на відповідну сторінку за допомогою навігаційного меню, або за адресою <Link to="/search"> ==Посилання на сторінку додавання посад== </Link>.
                            </p>
                            <p>
                                Форма пошуку посад розроблялася з метою зробити пошук посад максимально гнучким,
                                що було досягнуто завдяки можливості обирати:
                                <ul>
                                    <li>
                                        посадовий склад(усі, або декілька значень обираючи варіанти із відповідного журнального списку),
                                    </li>
                                    <li>
                                        приналежність посади(лише в КПІ, лише в державі, чи будь-які),
                                    </li>
                                    <li>
                                        проміжки у яких лежать дати створення та припинення дії посад,
                                    </li>
                                    <li>
                                        а також можливості обирати як проводитиметься перевірка імені посади у пошуку:
                                        <ul>
                                            <li>
                                                усі посади,
                                            </li>
                                            <li>
                                                точна відповідність або наявність введеного рядка назві посади,
                                            </li>
                                            <li>
                                                наявність хоча б одного, чи всіх ключових слів у назві посади.
                                            </li>
                                        </ul>
                                    </li>
                                </ul>
                            </p>
                            <p>
                                При цьому у випадку пошуку по введеному рядку після перключення фокуса із відповідного поля система підказує чи дасть пошук якісь результати, чи ні:
                            </p>
                            <p className="text-center">
                                <img src={img6} className="img-responsive img-thumbnail" alt="Рисунок 7.1" />
                            </p>
                            <p className="text-center">
                                <img src={img7} className="img-responsive img-thumbnail" alt="Рисунок 7.2" />
                            </p>
                            <br/>
                            <p>
                                <b>
                                    Якщо зробити пошук посад при початкових налаштуваннях у формі – виведуться усі посади.
                                </b>
                            </p>
                            <p>
                                Результати пошуку відображаються у таблиці, де рядкам відповідають окремі посади. Таблиця має такі стовпці: № рядка, Посадовий склад,	Назва посади, Створено в державі, Відмінено в державі, Створено в КПІ, Відмінено в КПІ.
                            </p>
                            <p>
                                Щоб переглянути детальну інформацію про посаду, потрібно натиснути на кнопку «Переглянути деталі» із піктограмою <i className="fa fa-chevron-down text-primary" /> з правої сторони рядка цієї посади.
                            </p>
                            <p className="text-center">
                                <img src={img12} className="img-responsive img-thumbnail" alt="Рисунок 7.3" />
                            </p>
                            <br/>
                            <p>
                                Для переключення стортування таблиці потрібно натиснути на заголовок стовпця по якому користувач хоче зробити сортування.
                            </p>
                            <p>
                                Під таблицею з результатами пошуку є випадаючий список для вибору розміру порції(кількості оночасно відображуваних рядків таблиці), меню пагінації(переходу між номерами порцій), кнопка для завантаження результатів пошуку у Excel-файл.
                            </p>
                        </Panel>
                        <Panel header="12. Редагування посад" eventKey="12">
                            <p>
                                Щоб відредагувати інформацію про посаду, необхідно зробити пошук посад.
                                У таблиці з результатами пошуку потрібно натиснути на кнопку з піктограмою <i className="fa fa-edit text-warning" />.
                            </p>
                            <p className="text-center">
                                <img src={img11} className="img-responsive img-thumbnail" alt="Рисунок 8.1" />
                            </p>
                            <br/>
                            <p>
                                Відкриється модальне вікно із заповненими полями форми, що аналогічна формі додавання.
                            </p>
                            <p>
                                При зміні тестів з описом посади з’являється перемикач що дозволяє застосувати зміни тексту також і у всіх посадах що використовують його.
                                Для цього після зміни значення у полі, приберіть фокус із поля - з'явиться кнопка-перемикач із піктограмою <i className="fa fa-fast-forward" />.
                                Щоб текст було змінено у посадах які використовують його, натисніть на цю кнопку-перемикач, піктограма зміниться на <i className="fa fa-check" /> <i className="fa fa-fast-forward" />
                            </p>
                            <p className="text-center">
                                <img src={img9} className="img-responsive img-thumbnail" alt="Рисунок 8.2" />
                            </p>
                            <p className="text-center">
                                <img src={img8} className="img-responsive img-thumbnail" alt="Рисунок 8.3" />
                            </p>
                        </Panel>
                        <Panel header="13. Видалення посад" eventKey="13">
                            <p>
                                Щоб видалити посаду, необхідно зробити пошук посад.
                                У таблиці з результатами пошуку потрібно натиснути на кнопку з піктограмою <i className="fa fa-trash text-danger" /> - з'явиться модальне вікно із підтвердженням видалення.
                            </p>
                            <p className="text-center">
                                <img src={img10} className="img-responsive img-thumbnail" alt="Рисунок 9.1" />
                            </p>
                            <br/>
                            <p>
                                Після натиснення на кнопку «Видалити» у цьому модальному вікні, посаду буде видалено.
                            </p>
                        </Panel>
                        <Panel header="14. Контроль списків" eventKey="14">
                            <p>
                                Для відкриття сторінки контролю списків можна перейти на неї через навігаційне меню, або за адресою <Link to="/ctrldict"> ==Посилання на сторінку контролю списків== </Link>.
                            </p>
                            <p>
                                Форма контролю списків має меню для вибору списку який користувач хоче переглянути чи відредагувати, та власне таблицю із відповідним списком. На цій формі можна додати нове значення у список, видалити чи відредагувати якесь із існуючих та переглянути які посади використовують певний елемент списку. Також можна відфільтрувати відображені значення списку на наявність у елементах введеного текстового рядка. Можна відсортувати відображений список за алфавітом за зростанням та спаданням значень.
                            </p>
                            <p>
                                Для оновлення списку останніми даним з сервера, потрібно натиснути на кнопку з піктограмою<i className="fa fa-refresh" /> яка розташована зправа від назви списку в меню «Списки значень у посадах».
                            </p>
                        </Panel>
                    </Accordion>
                </div>
            </div>
        </div>
    )
}