import React, { Component } from 'react'
import {Accordion, Panel} from 'react-bootstrap'
import { Link } from 'react-router'

import './styles.less'

import img1 from "./img/img1.jpg";
import img2 from "./img/img2.jpg";
import img3 from "./img/img3.jpg";
import img4 from "./img/img4.jpg";
import img5 from "./img/img5.jpg";
import img6 from "./img/img6.jpg";
import img7 from "./img/img7.jpg";
import img8 from "./img/img8.jpg";
import img9 from "./img/img9.jpg";
import img10 from "./img/img10.jpg";
import img11 from "./img/img11.jpg";
import img12 from "./img/img12.jpg";
import img13 from "./img/img13.jpg";
import img14 from "./img/img14.jpg";
import img15 from "./img/img15.jpg";
import img16 from "./img/img16.jpg";
import img17 from "./img/img17.jpg";
import img18 from "./img/img18.jpg";
import img19 from "./img/img19.jpg";
import img20 from "./img/img20.jpg";
import img21 from "./img/img21.jpg";
import img22 from "./img/img22.jpg";
import img23 from "./img/img23.jpg";
import img24 from "./img/img24.jpg";
import img25 from "./img/img25.jpg";
import img27 from "./img/img27.jpg";
import img26 from "./img/img26.jpg";
import img28 from "./img/img28.jpg";
import img29 from "./img/img29.jpg";
import img30 from "./img/img30.jpg";
import img31 from "./img/img31.jpg";
import img32 from "./img/img32.jpg";
import img33 from "./img/img33.jpg";
import img34 from "./img/img34.jpg";
import img35 from "./img/img35.jpg";
import img36 from "./img/img36.jpg";
import img37 from "./img/img37.jpg";
import img38 from "./img/img38.jpg";
import img39 from "./img/img39.jpg";
import img40 from "./img/img40.jpg";
import img41 from "./img/img41.jpg";
import img42 from "./img/img42.jpg";
import img43 from "./img/img43.jpg";
import img44 from "./img/img44.jpg";
import img45 from "./img/img45.jpg";
import img46 from "./img/img46.jpg";
import img47 from "./img/img47.jpg";
import img48 from "./img/img48.jpg";
import img49 from "./img/img49.jpg";
import img50 from "./img/img50.jpg";
import img51 from "./img/img51.jpg";
import img52 from "./img/img52.jpg";
import img53 from "./img/img53.jpg";
import img54 from "./img/img54.jpg";
import img55 from "./img/img55.jpg";
import img56 from "./img/img56.jpg";
import img57 from "./img/img57.jpg";
import img58 from "./img/img58.jpg";
import img59 from "./img/img59.jpg";
import img60 from "./img/img60.jpg";
import img61 from "./img/img61.jpg";

export default function HelpBox(props) {
    return (
        <div className="container">
            <div className="box box-default">
                <div className="box-header with-border text-center">
                    <h3 className="box-title"> Керівництво користувачу </h3>
                </div>
                <div className="box-body">
                    <Accordion className="accordion accordion--help">
                        <Panel header="1. Загальні відомості" eventKey="1">
                            <p>
                                АІС "КП" надає простий та зручний графічний інтерфейс користувачам
                                для управління базами даних посад в університеті та державі.
                            </p>
                        </Panel>
                        <Panel header='2. Можливості "АІС КП"' eventKey="2">
                            <p>
                                Система володіє наступними функціональними характеристиками:
                            </p>
                            <ul>
                                <li>
                                    Проведення аутентифікації та авторизації користувачів по їх логіну та паролю чи токену авторизації.
                                </li>
                                <li>
                                    Завантаження інформації про користувача, а саме імені, прізвища та фотографії(за умови наявності її у відповідній базі даних користувачів) та відображення цієї інформації на графічному інтерфейсі користувача системи щоб було видно хто зараз авторизований.
                                </li>
                                <li>
                                    Контроль доступу до системи в цілому та до кожної із основних операцій, а саме: <br/>
                                    -	контроль можливості додавання посад; <br/>
                                    -	контроль можливості редагування посад; <br/>
                                    -	контроль можливості видалення посад; <br/>
                                    -	контроль можливості пошуку посад; <br/>
                                    -	контроль можливості завантаження результатів пошуку у файл таблиці Excel; <br/>
                                    -	контроль можливості додавання нових значень до списків з даними які формують інформацію про посади; <br/>
                                    -	можливості видалення значень зі списків з даними які формують інформацію про посади; <br/>
                                    -	можливості редагування значень списків з даними які формують інформацію про посади.
                                </li>
                                <li>
                                    Можливість додавання нових посад із супутньою інформацією через графічний інтерфейс користувача.
                                </li>
                                <li>
                                    Можливість автоматизованого заповнення(через діалог з користувачем) полів із текстами («Завдання, обов'язки та повноваження», «Повинен знати», «Кваліфікаційні вимоги») та наборів кодів про нову посаду даними з інших посад.
                                </li>
                                <li>
                                    Перевірка на коректність введених даних, виведення повідомлень користувачу у випадках виникнення помилок.
                                </li>
                                <li>
                                    Можливість гнучкого пошуку посад(з накладанням фільтрів): назва посади, приналежність до посадового складу, наявність відповідної посади в КПІ/державі, діапазони дат створення та відміни посади.
                                </li>
                                <li>
                                    Можливість сортування результатів пошуку(за зростанням/спаданням значень полів посади), пагінація(відображення результатів пошуку порціями), вибір розміру відображуваної порції списку з результатами пошуку.
                                </li>
                                <li>
                                    Вивантаження результатів пошуку в Excel файл з можливістю вибору полів, які включаються в звіт та зміна їх порядку.
                                </li>
                                <li>
                                    Можливість редагування посади та інформації пов’язаної з нею через графічний інтерфейс користувача.
                                </li>
                                <li>
                                    Можливість видалення посад або пов’язаної з ними інформації через графічний інтерфейс користувача.
                                </li>
                                <li>
                                    Можливість перегляду, додавання нових значення, видалення, редагування списків з даними які формують інформацію про посади, а саме: посадового складу, кодів посад(КП, ЄТКД, ЗКППТР, ДКХП), текстів кваліфікаційних вимог, завдань обов’язків та повноважень посади через графічний інтерфейс користувача.
                                </li>
                            </ul>
                        </Panel>
                        <Panel header='3. Мета запровадження "АІС КП"' eventKey="3">
                            <p>
                                Ціллю створення даної АІС є надання простого та зручного
                                графічного інтерфейсу користувачам для роботи з
                                базами даних посад із можливістю гнучкого пошуку посад,
                                додавання нових значень, редагування, видалення посад,
                                при цьому необхідно контролювати доступ користувачів до системи
                                в залежності від повноважень авторизованих користувачів.
                            </p>
                        </Panel>
                        <Panel header="4. Системні вимоги" eventKey="4">
                            <p>
                                Для роботи додатку необхідне мережеве з’єднання комп’ютера із
                                сервером та веб-браузер Opera, Mozilla Firefox, чи Google Chrome останньої версії.
                                <br/>
                                Коректність роботи гарантується у браузері Google Chrome версій 45-58.
                            </p>
                        </Panel>
                        <Panel header='5. Що ви повинні знати' eventKey="5">
                            <p>
                                Характер викладу даного Посібника припускає,
                                що ви маєте базові навички роботи з комп'ютером,
                                операційною системою та WEB-браузером,
                                а також знаєте предметну область
                                (особливості посад в НТУУ "КПІ ім. Ігоря Сікорського" та Україні загалом)
                            </p>
                            <p>
                                Якщо ви недостатньо добре володієте перерахованими вище поняттями і навичками,
                                рекомендуємо звернутися до документації чи спеціалістів по цим темам.
                            </p>
                            <p>
                                <br/>
                                <b> Увага! Інформація про посади у цій системі має такі особливості: </b> <br/>
                            </p>
                            <ol>
                                <li>
                                    Назви посад у системі формуються ієрархічно,
                                    як <u> уточнювана посада </u> та <u>уточнюючтй вираз(уточнення)</u>. <br/>
                                    Наприклад, посада "Головний страховий експерт з охорони праці"
                                    має таку структуру: <br/>
                                    головний -> експерт -> страховий -> з охорони праці <br/>
                                    Якщо це нова посада(вона не уточнює жодну із інших посад),
                                    то її назва складається із самого лиш <u>уточнення</u>,
                                    а <u>"уточнювана посада"</u> відсутня. <br/>
                                </li>
                                <li>
                                    Інформація про усі основні поля посади(а, саме
                                    Посадовий склад,
                                    Уточнення,
                                    Код КП,
                                    Код ЄТДК,
                                    Код ЗКППТР,
                                    Код ДКХП,
                                    Завдання, обов'язки та повноваження,
                                    Повинен знати,
                                    Кваліфікаційні вимоги)
                                    береться із відповідних списків.
                                    Елементи цих списків можна контролювати на спеціальній сторінці
                                    <Link to="/ctrldict"> "Контроль списків" </Link>.
                                </li>
                            </ol>
                        </Panel>
                        <Panel header="6. Інтерфейс програми" eventKey="6">
                            <p>
                                Система має 6 основних сторінок із можливістю навігації між ними:
                            </p>
                            <ul>
                                <li>
                                    сторінка авторизації, де неавторизованим користувачам показується форма авторизації, а авторизованим – меню для навігації між сторінками.
                                </li>
                                <li>
                                    сторінка додавання посад
                                </li>
                                <li>
                                    сторінка контролю списків
                                </li>
                                <li>
                                    сторінка пошуку та перегляду посад
                                </li>
                                <li>
                                    сторінка "Про програму"
                                </li>
                                <li>
                                    сторінка "Керівництво користувачу"
                                </li>
                            </ul>
                            <p>
                                В залежності від прав доступу користувача,
                                деякі з цих сторінок будуть йому недоступними,
                                а при спробі відкрити сторінку доступ до якої користувачу заборонено,
                                його буде перенаправлено на сторінку авторизації і виведено відповідне повідомлення.
                            </p>
                            <p>
                                У всіх станах (крім процесу авторизації користувача із
                                відображуваною на екрані лише формою для авторизації та сторінки "Про програму")
                                на екрані є компоненти із:
                            </p>
                            <ul>
                                <li>
                                    «Шапкою» (Header), де розміщується: логотип додатку,
                                    навігаційне меню, піктограма авторизованого користувача
                                    з випадаючим меню у яому є посилання на сторінки "Про програму" та "Керівництво користувачу"
                                    і кнопка для виходу із системи.
                                    <div className="text-center">
                                        <img src={img13} className="img-responsive img-thumbnail" alt="Рисунок 6.1" />
                                    </div>
                                    <br/>
                                </li>
                                <li>
                                    Блок із основною активною формою (для додавання посад, пошуку, тощо)
                                    <div className="text-center">
                                        <img src={img14} className="img-responsive img-thumbnail" alt="Рисунок 6.2" />
                                    </div>
                                    <br/>
                                </li>
                                <li>
                                    «Нижнім колонтитулом»(Footer) у якому розміщено інформацію про розробників програмного продукту
                                    <div className="text-center">
                                        <img src={img15} className="img-responsive img-thumbnail" alt="Рисунок 6.3" />
                                    </div>
                                    <br/>
                                </li>
                            </ul>
                            <p>
                                Посилання у навігаційному меню:
                            </p>
                            <ul>
                                <li>
                                    При виборі пункту "<i className="fa fa-plus" /> Додати" головного навігаційного меню,
                                    користувача буде перенаправлено на сторінку додавання посад.
                                </li>
                                <li>
                                    При виборі пункту "<i className="fa fa-search" /> Пошук" головного навігаційного меню,
                                    користувача буде перенаправлено на сторінку пошуку посад та перегляду інформації про посади.
                                </li>
                                <li>
                                    При виборі пункту "<i className="fa fa-book" /> Списки" головного навігаційного меню,
                                    користувача буде перенаправлено на сторінку контролю списків, які використовуються для формування інформації про посади.
                                </li>
                            </ul>
                        </Panel>
                        <Panel header="7. Реєстрація нових користувачів" eventKey="7">
                            <p>
                                Реєстрацією нових користувачів уповноважений займатися тільки системний адміністратор або адміністратор бази даних. При цьому якщо ви бажаєте встановити/змінити ваш персональний логін – для цього теж необхідно звернутися до системного адміністратора або адміністратора БД, який додасть/змінить ваші персональні дані в БД та назначить вам небхідні права доступу.
                            </p>
                            <p>
                                Після отримання комбінації логін/пароль від адміністраторів особисто або в електронному листі ви маєте доступ до додатку.
                            </p>
                        </Panel>
                        <Panel header="8. Вхід у систему" eventKey="8">
                            <p>
                                <b>
                                    Без реалізації попереднього пункту(отримання вашого логіна та пароля від уповноваженої особи) вхід у програму не є можливим.
                                </b>
                            </p>
                            <p>
                                Для роботи із додатком необхідно авторизуватися. Доступ неавторизованим користувачам заборонено.
                            </p>
                            <div className="text-center">
                                <img src={img16} className="img-responsive img-thumbnail" alt="Рисунок 8.1" />
                            </div>
                            <br/>
                            <p>
                                У разі, якщо ви правильно ввели дані (логін та пароль), завантажаться дані про вас
                            </p>
                            <div className="text-center">
                                <img src={img17} className="img-responsive img-thumbnail" alt="Рисунок 8.2" />
                            </div>
                            <br/>
                            <p>
                                Після завантаження даних із сервера, замість форми авторизації з’явиться меню навігації для переходу до форм додавання, пошуку посад, контролю списків даних які використовуютьс посадами та виходу із системи.
                            </p>
                            <div className="text-center">
                                <img src={img19} className="img-responsive img-thumbnail" alt="Рисунок 8.3" />
                            </div>
                            <br/>
                            <p>
                                Якщо у полях для авторизації було допущено помилку, логін/пароль не вірні, нема мережевого з’єднання, чи сталася помилка на сервері система виведе відповідне повідомлення.
                            </p>
                            <div className="text-center">
                                <img src={img20} className="img-responsive img-thumbnail" alt="Рисунок 8.4" />
                                <img src={img18} className="img-responsive img-thumbnail" alt="Рисунок 8.5" />
                            </div>
                            <br/>
                        </Panel>
                        <Panel header="9. Вихід із аккаунта" eventKey="9">
                            <p>
                                Для виходу із аккаунта потрібно натиснути на кнопку з текстом "Вихід з аккаунта":
                            </p>
                            <p> a) В меню домашньої сторінки </p>
                            <div className="text-center">
                                <img src={img1} className="img-responsive img-thumbnail" alt="Рисунок 9.1" />
                            </div>
                            <br/>
                            <p>
                                б) У випадаючому меню(щоб воно з'явилось потрібно натиснути на ім'я користувача) під іменем користувача у "Шапці" (верхній панелі) додатку
                            </p>
                            <div className="text-center">
                                <img src={img2} className="img-responsive img-thumbnail" alt="Рисунок 9.2" />
                            </div>
                        </Panel>
                        <Panel header="10. Додавання посад" eventKey="10">
                            <p>
                                Додавання посад відбувається на відповідній формі, перейти до якої можна за допомогою навігаційного меню, або за адресою <Link to="/add"> ==Посилання на сторінку додавання посад== </Link>.
                            </p>
                            <p>
                                Ця форма має текстові поля для введення усіх даних про посаду.
                                Тут частину даних треба ввести як вручну(
                                Повна назва посади,
                                Скорочена назва посади,
                                Завдання, обов'язки та повноваження,
                                Повинен знати,
                                Кваліфікаційні вимоги,
                                Посилання на правові документи про загальну інформацію,
                                Посилання на правові документи про тексти з описом посади), а
                                частина полів заповнюється значеннями із списків-словників
                                (Посадовий склад, Уточнювана посада, Уточнювана посада, Коди),
                                які підвантажуються із сервера.
                            </p>
                            <p>
                                Поля "Повна назва посади" та "Скорочена назва посади" заповнюються автоматично при виборі
                                значеннь полів "Уточнювана посада" та "Уточнення". Потім значення полів
                                "Повна назва посади" та "Скорочена назва посади" можна підредагувати щоб вони мали
                                необхідний порядок слів, але при цьому у ієрархії назви збережеться яка посада уточнюється,
                                а яка посада є уточнюючою.
                            </p>
                            <p>
                                Для вибору значення із випадаючого списку, натисніть на це поле, відкриється Випадаючий список.
                                З самого початку підвантажується 50 значень із списку.
                                Потім, коли користувач починає друкувати текст у полі для фільтрації значень випадаючого списку,
                                із сервера підвантажаться інші значення списку, які містять введений текст для фільтрації.
                            </p>
                            <div className="text-center">
                                <img src={img21} className="img-responsive img-thumbnail" alt="Рисунок 10.1" />
                            </div>
                            <br/>
                            <p>
                                Тексти з описом посади(завдання, обов'язки та повноваження, повинен знати, кваліфікаційні вимоги), та коди можна додати із інших посад у відповідному модальному вікні для цього треба натиснути на кнопку з піктограмою<i className="fa fa-link" />.
                            </p>
                            <div className="text-center">
                                <img src={img3} className="img-responsive img-thumbnail" alt="Рисунок 10.2" />
                            </div>
                            <br/>
                            <p>
                                Відкриється модальне вікно з пошуковою формою.
                                Користувач може знайти там інші посади та обрати необхідне значення,
                                після чого це значення підставиться у відповідне поле на формі додавання.
                            </p>
                            <div className="text-center">
                                <img src={img24} className="img-responsive img-thumbnail" alt="Рисунок 10.3" />
                            </div>
                            <div className="text-center">
                                <img src={img22} className="img-responsive img-thumbnail" alt="Рисунок 10.4" />
                            </div>
                            <br/>
                            <p>
                                Так як кожна посада могла у різні терміни своєї дії мати різні набори кодів та текстів з описами, на формі можна додавати чи видаляти декілька наборів з відповідними полями. Для додавання ще 1 набору кодів, чи тексту потрібно натиснути на кнопку з піктограмою «+» під іншими полями цієї секії, а для видалення 1 із порцій, треба натиснути на кнопку з піктограмою «х» у правому верхньому кутку відповідної порції полів.
                            </p>
                            <div className="text-center">
                                <img src={img4} className="img-responsive img-thumbnail" alt="Рисунок 10.5" />
                            </div>
                            <br/>
                            <p>
                                У полях для дат їх можна ввести як вручну, так і додати зі зручного віджета-календаря.
                            </p>
                            <div className="text-center">
                                <img src={img5} className="img-responsive img-thumbnail" alt="Рисунок 10.6" />
                            </div>
                            <br/>
                            <p>
                                Перед відправкою даних на сервер проводиться валідація введених даних та виведення підказок користувачеві про наявні помилки.
                            </p>
                            <div className="text-center">
                                <img src={img23} className="img-responsive img-thumbnail" alt="Рисунок 10.7" />
                            </div>
                        </Panel>
                        <Panel header="11. Пошук, перегляд посад" eventKey="11">
                            <p>
                                Для пошуку та перегляду посад треба перейти на відповідну сторінку за допомогою навігаційного меню, або за адресою <Link to="/search"> ==Посилання на сторінку додавання посад== </Link>.
                            </p>
                            <div className="text-center">
                                <img src={img25} className="img-responsive img-thumbnail" alt="Рисунок 11.1" />
                            </div>
                            <br/>
                            <p>
                                Форма пошуку посад розроблялася з метою зробити пошук посад максимально гнучким,
                                що було досягнуто завдяки можливості обирати:
                            </p>
                            <ul>
                                <li>
                                    посадовий склад(усі, або декілька значень обираючи варіанти із відповідного журнального списку),
                                </li>
                                <li>
                                    приналежність посади(лише в КПІ, лише в державі, чи будь-які),
                                </li>
                                <li>
                                    проміжки у яких лежать дати створення та припинення дії посад,
                                </li>
                                <li>
                                    а також можливості обирати як проводитиметься перевірка імені посади у пошуку:
                                    <ul>
                                        <li>
                                            усі посади,
                                        </li>
                                        <li>
                                            точна відповідність або наявність введеного рядка назві посади,
                                        </li>
                                        <li>
                                            наявність хоча б одного, чи всіх ключових слів у назві посади.
                                        </li>
                                    </ul>
                                </li>
                            </ul>
                            <p>
                                При цьому у випадку пошуку по введеному рядку після перключення фокуса із відповідного поля система підказує чи дасть пошук якісь результати, чи ні:
                            </p>
                            <div className="text-center">
                                <img src={img6} className="img-responsive img-thumbnail" alt="Рисунок 11.2" />
                            </div>
                            <div className="text-center">
                                <img src={img7} className="img-responsive img-thumbnail" alt="Рисунок 11.3" />
                            </div>
                            <br/>
                            <p>
                                <b>
                                    Якщо зробити пошук посад при початкових налаштуваннях у формі – виведуться усі посади.
                                </b>
                            </p>
                            <p>
                                Результати пошуку відображаються у таблиці, де рядкам відповідають окремі посади. Таблиця має такі стовпці: № рядка, Посадовий склад,	Назва посади, Створено в державі, Відмінено в державі, Створено в КПІ, Відмінено в КПІ.
                            </p>
                            <p>
                                Щоб переглянути детальну інформацію про посаду, потрібно натиснути на кнопку
                                «Переглянути деталі» із піктограмою <i className="fa fa-chevron-down text-primary"/> з
                                правої сторони рядка цієї посади.
                            </p>
                            <div className="text-center">
                                <img src={img12} className="img-responsive img-thumbnail" alt="Рисунок 11.4" />
                                <img src={img27} className="img-responsive img-thumbnail" alt="Рисунок 11.5" />
                            </div>
                            <br/>
                            <p>
                                Для переключення стортування таблиці потрібно натиснути на заголовок стовпця по якому користувач хоче зробити сортування.
                            </p>
                            <div className="text-center">
                                <img src={img28} className="img-responsive img-thumbnail" alt="Рисунок 11.6" />
                                <img src={img26} className="img-responsive img-thumbnail" alt="Рисунок 11.7" />
                            </div>
                            <br/>
                            <p>
                                Під таблицею з результатами пошуку є:
                            </p>
                            <ul>
                                <li>
                                    Випадаючий список для вибору розміру кількості оночасно відображуваних рядків таблиці:
                                    <div className="text-center">
                                        <img src={img31} className="img-responsive img-thumbnail" alt="Рисунок 11.8" />
                                    </div>
                                    <br/>
                                    Щоб Змінити кількість оночасно відображуваних рядків таблиці,
                                    натисніть на поточне значення(наприклад 10) та оберіть інше значення
                                    у випадаючому списку:
                                    <div className="text-center">
                                        <img src={img32} className="img-responsive img-thumbnail" alt="Рисунок 11.9" />
                                    </div>
                                    <br/>
                                </li>
                                <li>
                                    Меню пагінації(переходу між номерами порцій):
                                    <div className="text-center">
                                        <img src={img29} className="img-responsive img-thumbnail" alt="Рисунок 11.10" />
                                    </div>
                                    <br/>
                                    Щоб перейти на іншу порцію рядків таблиці, натисніть на необхідний номер у меню
                                    пагінації, чи на стрілки:
                                    <ul>
                                        <li>"‹" - перейти до попередньої порції,</li>
                                        <li>"›" - перейти до наступної порції,</li>
                                        <li>"«" - перейти на початок,</li>
                                        <li>"»" - перейти в кінець</li>
                                    </ul>
                                    <br/>
                                </li>
                                <li>
                                    Кнопка для завантаження результатів пошуку у Excel-файл:
                                    <div className="text-center">
                                        <img src={img30} className="img-responsive img-thumbnail" alt="Рисунок 11.11" />
                                    </div>
                                </li>
                            </ul>
                        </Panel>
                        <Panel header="12. Завантаження результатів пошуку у Excel-файл" eventKey="12">
                            <p>
                                Щоб завантажити результати пошуку у Excel-файл, необхідно спершу зробити пошук посад.
                            </p>
                            <p>
                                Під таблицею з результатами пошуку натисніть на кнопку "Завантажити результати"
                            </p>

                            <div className="text-center">
                                <img src={img30} className="img-responsive img-thumbnail" alt="Рисунок 12.1" />
                            </div>
                            <br/>
                            <p>
                                Відкриється діалогове вікно для налаштування завантаження:
                            </p>
                            <div className="text-center">
                                <img src={img33} className="img-responsive img-thumbnail" alt="Рисунок 12.2" />
                            </div>
                            <br/>
                            <p>
                                В цьому діалоговому вікні користувач може відмітити за допомогою відповідних чекбоксів
                                які поля мають бути присутніми у Excel файлі
                                (відмічені поля буде включено, а не відмінчені не буде включено):
                            </p>
                            <div className="text-center">
                                <img src={img34} className="img-responsive img-thumbnail" alt="Рисунок 12.3" />
                            </div>
                            <br/>
                            <p>
                                Також можна змінити порядок стовпців Excel-таблиці.
                                Для цього треба натиснути на іконку "::" біля назви стовпця порядок якого ви хочете
                                змінити та не відпускаючи кнопки мишки перетягнути його у іншу позицію(вверх чи вниз):
                            </p>
                            <div className="text-center">
                                <img src={img35} className="img-responsive img-thumbnail" alt="Рисунок 12.4" />
                            </div>
                            <br/>
                            <p>
                                Для відміни завантаження результатів пошуку натисніть на кнопку "Відміна" розташовану у
                                нижній частині цього модального вікна:
                            </p>
                            <div className="text-center">
                                <img src={img36} className="img-responsive img-thumbnail" alt="Рисунок 12.5" />
                            </div>
                            <br/>
                            <p>
                                Щоб повернути форму налаштування результатів пошуку у початковий стан натисніть на кнопку
                                "Повернути у початковий стан" розташовану у нижній частині цього модального вікна:
                            </p>
                            <div className="text-center">
                                <img src={img37} className="img-responsive img-thumbnail" alt="Рисунок 12.6" />
                            </div>
                            <br/>
                            <p>
                                Закінчивши налаштування результатів пошуку натисніть на кнопку "Завантажити"
                                розташовану у нижній частині цього модального вікна.
                            </p>
                            <div className="text-center">
                                <img src={img38} className="img-responsive img-thumbnail" alt="Рисунок 12.7" />
                            </div>
                            <br/>
                            <p>
                                У новій вкладці буде згенеровано та завантажено Excel-файл із результатами пошуку.
                            </p>
                            <div className="text-center">
                                <img src={img39} className="img-responsive img-thumbnail" alt="Рисунок 12.8" />
                            </div>
                            <br/>
                        </Panel>
                        <Panel header="13. Редагування посад" eventKey="13">
                            <p>
                                Щоб відредагувати інформацію про посаду, необхідно зробити пошук посад.
                                У таблиці з результатами пошуку потрібно натиснути на кнопку з піктограмою
                                <i className="fa fa-edit text-warning" />.
                            </p>
                            <div className="text-center">
                                <img src={img11} className="img-responsive img-thumbnail" alt="Рисунок 13.1" />
                            </div>
                            <br/>
                            <p>
                                Відкриється модальне вікно із заповненими полями форми, що аналогічна формі додавання.
                            </p>
                            <div className="text-center">
                                <img src={img40} className="img-responsive img-thumbnail" alt="Рисунок 13.2" />
                            </div>
                            <br/>
                            <p>
                                При зміні тестів з описом посади з’являється перемикач що дозволяє застосувати зміни тексту також і у всіх посадах що використовують його.
                            </p>
                            <p>
                                Наприклад, якщо текст "Кваліфікаційні вимоги" однаковий для посад "Бармен" і "Бармен 1 розряду",
                                то можна змінивши текст у описі однієї з цих посад, застосувати зміни і для інших.
                            </p>
                            <p>
                                Для цього після зміни значення у полі, приберіть фокус із поля - з'явиться кнопка-перемикач із піктограмою <i className="fa fa-fast-forward" />.
                            </p>
                            <p>
                                Щоб текст було змінено у посадах які використовують його, натисніть на цю кнопку-перемикач, піктограма зміниться на <i className="fa fa-check" /> <i className="fa fa-fast-forward" />
                            </p>
                            <div className="text-center">
                                <img src={img9} className="img-responsive img-thumbnail" alt="Рисунок 13.3" />
                            </div>
                            <div className="text-center">
                                <img src={img8} className="img-responsive img-thumbnail" alt="Рисунок 13.4" />
                            </div>
                            <br/>
                            <p>
                                Якщо перемикач залишити неактивним (показуватиметься піктограма <i className="fa fa-fast-forward" />),
                                то текст буде змінено лише для цієї посади, у інших посадах текст залишиться старим.
                            </p>
                            <p>
                                Якщо після зміни тексту з описом посади такий перемикач не з'явився, значить цей текст не
                                використовується іншими посадами.
                            </p>
                            <br/>
                            <br/>
                            <p>
                                Для відміни редагування інформації про посаду натисніть на кнопку "Відміна" розташовану у
                                нижній частині цього модального вікна:
                            </p>
                            <div className="text-center">
                                <img src={img42} className="img-responsive img-thumbnail" alt="Рисунок 13.5" />
                            </div>
                            <br/>
                            <p>
                                Щоб повернути форму редагування інформації про посаду у початковий стан натисніть на кнопку
                                "Очистити форму" розташовану у нижній частині цього модального вікна:
                            </p>
                            <div className="text-center">
                                <img src={img43} className="img-responsive img-thumbnail" alt="Рисунок 13.6" />
                            </div>
                            <br/>

                            <p>
                                Завершивши редагування посади, натисніть на кнопку "Зберегти зміни"
                                <b>(інакше внесені зміни не буде збережено!)</b>
                            </p>
                            <div className="text-center">
                                <img src={img41} className="img-responsive img-thumbnail" alt="Рисунок 13.7" />
                            </div>
                        </Panel>
                        <Panel header="14. Видалення посад" eventKey="14">
                            <p>
                                Щоб видалити посаду, необхідно зробити пошук посад.
                                У таблиці з результатами пошуку потрібно натиснути на кнопку з піктограмою <i className="fa fa-trash text-danger" /> - з'явиться модальне вікно із підтвердженням видалення.
                            </p>
                            <div className="text-center">
                                <img src={img10} className="img-responsive img-thumbnail" alt="Рисунок 14.1" />
                            </div>
                            <br/>
                            <div className="text-center">
                                <img src={img44} className="img-responsive img-thumbnail" alt="Рисунок 14.2" />
                            </div>
                            <br/>
                            <p>
                                Для відміни видалення інформації про цю посаду натисніть на кнопку "Відміна" розташовану у
                                нижній частині цього модального вікна:
                            </p>
                            <div className="text-center">
                                <img src={img45} className="img-responsive img-thumbnail" alt="Рисунок 14.3" />
                            </div>
                            <br/>
                            <p>
                                Якщо поставити чекбокс на полі "Більше не показувати попередження",
                                то після натиснення на кнопку "Видалити", попередження більше
                                не показуватимуться(до наступного оновлення сторінки користувачем),
                                а видалення одразу відбуватиметься після натиснення на кнопку
                                з піктограмою <i className="fa fa-trash text-danger" /> у раблиці з результатами пошуку посад:
                            </p>
                            <div className="text-center">
                                <img src={img46} className="img-responsive img-thumbnail" alt="Рисунок 14.4" />
                            </div>
                            <br/>
                            <p>
                                Після натиснення на кнопку «Видалити» у цьому модальному вікні, посаду буде видалено.
                            </p>
                            <div className="text-center">
                                <img src={img47} className="img-responsive img-thumbnail" alt="Рисунок 14.5" />
                            </div>
                            <br/>
                        </Panel>
                        <Panel header="15. Контроль списків" eventKey="15">
                            <p>
                                Для відкриття сторінки контролю списків можна перейти на неї через навігаційне меню,
                                або за адресою <Link to="/ctrldict"> ==Посилання на сторінку контролю списків== </Link>.
                            </p>
                            <p>
                                Форма контролю списків має меню для вибору списку який користувач хоче переглянути
                                чи відредагувати, та власне таблицю із відповідним списком.
                                На цій формі можна додати нове значення у список, видалити чи відредагувати якесь
                                із існуючих та переглянути які посади використовують певний елемент списку.
                                Також можна відфільтрувати відображені значення списку на наявність
                                у елементах введеного текстового рядка.
                                Можна відсортувати відображений список за алфавітом за зростанням та спаданням значень.
                            </p>
                            <div className="text-center">
                                <img src={img48} className="img-responsive img-thumbnail" alt="Рисунок 15.1" />
                            </div>
                            <br/>
                            <br/>
                            <p>
                                Для оновлення списку останніми даними з сервера, потрібно натиснути на кнопку
                                з піктограмою <i className="fa fa-refresh" /> яка розташована зправа від
                                назви списку в меню «Списки значень у посадах».
                            </p>
                            <div className="text-center">
                                <img src={img49} className="img-responsive img-thumbnail" alt="Рисунок 15.2" />
                            </div>
                            <br/>
                            <br/>
                            <p>
                                Щоб відфільтрувати відображені значення списку на наявність у елементах введеного
                                текстового рядка введіть значення за яким ви хочете відфільтрувати список
                                у текстове поле "Пошук значень у списку" та натисніть на кнопку з піктограмою
                                "<i className="fa fa-search" />"
                            </p>
                            <div className="text-center">
                                <img src={img50} className="img-responsive img-thumbnail" alt="Рисунок 15.3" />
                            </div>
                            <br/>
                            <p>
                                Якщо у обраному списку нема жодного значення що містило б введений текстовий рядок,
                                система повідомить про це.
                            </p>
                            <p>
                                Щоб відмінити фільтрацію списку по введеному рядку натисніть на кнопку
                                з піктограмою "<i className="fa fa-times-circle" />" розташовану поряд з текстовим полем для пошуку
                            </p>
                            <div className="text-center">
                                <img src={img51} className="img-responsive img-thumbnail" alt="Рисунок 15.4" />
                            </div>
                            <br/>
                            <br/>
                            <p>
                                Щоб відсортувати відображений список за алфавітом за зростанням, чи спаданням значень
                                натисніть на кнопку з піктограмою "<i className="fa fa-sort" />" розташовану
                                над таблицею зі значеннями обраного списку.
                                Піктограми на цій кнопці мають таке значення:
                            </p>
                            <ul>
                                <li> "<i className="fa fa-sort" />" - сортування за алфавітом не включено </li>
                                <li> "<i className="fa fa-sort-amount-asc" />" - включено сотрування за алфавітом за зростанням </li>
                                <li> "<i className="fa fa-sort-amount-desc" />" - включено сотрування за алфавітом за спаданням </li>
                            </ul>
                            <div className="text-center">
                                <img src={img52} className="img-responsive img-thumbnail" alt="Рисунок 15.5" />
                            </div>
                            <br/>
                            <br/>
                            <p>
                                Щоб додати нове значення до обраного списку натисніть на кнопку з піктограмою
                                "<i className="fa fa-plus" />" розташовану під таблицею зі значеннями списку:
                            </p>
                            <div className="text-center">
                                <img src={img53} className="img-responsive img-thumbnail" alt="Рисунок 15.6" />
                            </div>
                            <br/>
                            <p>
                                Замість цієї кнопки з піктограмою "<i className="fa fa-plus" />" з'явиться текстове поле
                                у якому користувач може ввести нове значення.
                                <br/>
                                Щоб додати введене значення до списку натисніть на кнопку з піктограмою
                                "<i className="fa fa-save" />" розташовану поряд з текстовим полем:
                            </p>
                            <div className="text-center">
                                <img src={img54} className="img-responsive img-thumbnail" alt="Рисунок 15.7" />
                            </div>
                            <br/>
                            <p>
                                Щоб відмінити додавання введеного значення до списку натисніть на кнопку з піктограмою
                                "<i className="fa fa-close" />" розташовану поряд з текстовим полем:
                            </p>
                            <div className="text-center">
                                <img src={img55} className="img-responsive img-thumbnail" alt="Рисунок 15.8" />
                            </div>
                            <br/>
                            <br/>
                            <p>
                                Щоб видалити значення зі списку натисніть на кнопку з піктограмою
                                "<i className="fa fa-trash" />" розташовану поряд зі значенням цього списку.
                                Якщо значення списку використовується якимись посадами його неможливо буде видалити,
                                у такому випадку треба спершу видалити інформацію про ті посади,
                                чи відредагувати інформацію про ті посади щоб вони не використовували це значення списку:
                            </p>
                            <div className="text-center">
                                <img src={img57} className="img-responsive img-thumbnail" alt="Рисунок 15.9" />
                            </div>
                            <br/>
                            <br/>
                            {/*<p>         Мб тут ще описати підтвердження видалення         </p>*/}
                            {/*<p>         Мб тут ще описати підтвердження видалення         </p>*/}
                            {/*<p>         Мб тут ще описати підтвердження видалення         </p>*/}
                            <p>
                                Щоб переглянути список посад які використовують це значення списку натисніть на кнопку
                                з піктограмою "<i className="fa fa-link text-muted" style={{"transform": "rotate(-45deg)"}}/>"
                                розташовану поряд зі значенням цього списку
                                (якщо значення списку не використовується жодною посадою, ця кнопка буде неактивною):
                            </p>
                            <div className="text-center">
                                <img src={img58} className="img-responsive img-thumbnail" alt="Рисунок 15.10" />
                            </div>
                            <br/>
                            <p>
                                Якщо натиснути на назву посади у цьому списку, відкриється модальне вікно для редагування
                                інформації про цю посаду.
                            </p>
                            <p>
                                Якщо при завантаженні списку посад які використовують це значення списку сталася помилка
                                (наприклад пропало мережеве з'єднання із серверемо, тощо),
                                можна натиснути на кнопку "Оновити список назв посад",
                                щоб оновити список посад які використовують це значення.
                            </p>
                            <div className="text-center">
                                <img src={img59} className="img-responsive img-thumbnail" alt="Рисунок 15.11" />
                            </div>
                            <br/>
                            <br/>
                            <p>
                                Щоб відредагувати значення списку натисніть на кнопку з піктограмою
                                "<i className="text-warning fa fa-edit" />" розташовану поряд зі значенням цього списку.
                                <br/>
                            </p>
                            <div className="text-center">
                                <img src={img60} className="img-responsive img-thumbnail" alt="Рисунок 15.12" />
                            </div>
                            <br/>
                            <p>
                                Відкриється діалогове вікно із полем де ви можете змінити значення списку.
                            </p>
                            <p>
                                Щоб відмінити редагування натисніть на кнопку "Відміна" розташовану у нижній частині
                                цього діалогового вікна.
                            </p>
                            <p>
                                Завершивши редагування значення, натисніть на кнопку "Зберегти"
                                <b>(інакше внесені зміни не буде збережено!)</b>
                            </p>
                            <div className="text-center">
                                <img src={img61} className="img-responsive img-thumbnail" alt="Рисунок 15.13" />
                            </div>
                            <br/>
                            <br/>


                            <p>
                                Якщо значення списку занадто велике(наприклад текст з описом кваліфікаційних вимог)
                                воно буде обрізане та показано лише частина тексту щоб займало менше місця у таблиці.
                                Для того щоб переглянути повний текст, натисніть на кнопку з піктограмою
                                "<i className="fa fa-chevron-down text-info" />" розташовану поряд зі значенням цього списку:
                            </p>
                            <div className="text-center">
                                <img src={img56} className="img-responsive img-thumbnail" alt="Рисунок 15.14" />
                            </div>
                            <br/>
                        </Panel>
                    </Accordion>
                </div>
            </div>
        </div>
    )
}